---
type: HVACLoadType
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 15
tags: [revit-api, class]
---

# HVACLoadType

`Autodesk.Revit.DB.Analysis.HVACLoadType` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | AirChangesPerHour | 2018 | `public double AirChangesPerHour { get ; set ; }` |
| Property | AreaPerPerson | 2018 | `public double AreaPerPerson { get ; set ; }` |
| Property | CoolingSetPoint | 2021.1 | `public double CoolingSetPoint { get ; set ; }` |
| Property | DehumidificationSetPoint | 2021.1 | `public double DehumidificationSetPoint { get ; set ; }` |
| Property | HeatingSetPoint | 2021.1 | `public double HeatingSetPoint { get ; set ; }` |
| Property | HumidificationSetPoint | 2021.1 | `public double HumidificationSetPoint { get ; set ; }` |
| Property | LatentHeatGainPerPerson | 2018 | `public double LatentHeatGainPerPerson { get ; set ; }` |
| Property | LightingLoadDensity | 2018 | `public double LightingLoadDensity { get ; set ; }` |
| Property | OutdoorAirFlowStandard | 2018 | `public OutdoorAirFlowStandard OutdoorAirFlowStandard { get ; set ; }` |
| Property | OutdoorAirPerArea | 2018 | `public double OutdoorAirPerArea { get ; set ; }` |
| Property | OutdoorAirPerPerson | 2018 | `public double OutdoorAirPerPerson { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | PlenumLighting | 2018 | `public double PlenumLighting { get ; set ; }` |
| Property | PowerLoadDensity | 2018 | `public double PowerLoadDensity { get ; set ; }` |
| Property | SensibleHeatGainPerPerson | 2018 | `public double SensibleHeatGainPerPerson { get ; set ; }` |